{
	"header": {
		"start": "Start",
		"contact": "Contact",
		"about": "About",
		"portfolio": "Portfolio",
		"theme": "theme"
	},
	"footer": {
		"contact": "Contact",
		"about": "About",
		"cv": "My CV"
	},
	"lang_options": {
		"pt": "Portuguese",
		"en": "English"
	},
	"construction": {
		"thank_you": "Thank you for your visit.",
		"under_construction": "This webpage is currently under construction.<br>Please come back in the near future to check its content."
	},
	"contact": {
		"title": "Developer's Contact - Andre Carvalho",
		"description": "If you wish to contact me, to make a job offer or any other inquiries, you can find out how on this section.",
		"keywords": "andre carvalho, andre, carvalho, portfolio, developer, dev, hire, offers, curriculum, solo developer, html, css, javascript, php, c++, github, technology, freelancer, freelance, freelancing",
		"heading_1": "Let's work together",
		"paragraph_1": "The best way to reach me is by e-mail, at",
		"paragraph_1_2": "I’m open to job opportunities, freelance projects, and collaboration with other developers.",
		"heading_2": "Useful links",
		"heading_3": "Contact me",
		"name": "Name",
		"message": "Message",
		"send": "submit"
	},
	"about": {
		"title": "About me - Andre Carvalho",
		"description": "Here you can find more descriptive information about me and my skills.",
		"keywords": "andre carvalho, andre, carvalho, portfolio, developer, dev, hire, offers, curriculum, solo developer, html, css, javascript, php, c++, github, technology, freelancer, freelance, freelancing",
		"heading_1": "About me",
		"about_me_p_1": "Hello, I am André, a 24-year-old developer living in Curitiba, south of Brazil.",
		"about_me_p_2": "I have been writing code since around 2018. I learned Python as my first language, and have since studied many things, ranging from web development with HTML/CSS/JS, PHP, React, to application development with Electron, Kotlin (Jetpack Compose) and even game development. Programming is something I enjoy no matter the subject, so I’m always interested in trying new things.",
		"about_me_note_1_part1": "Check my",
		"about_me_note_1_cv_link": "CV",
		"about_me_note_1_part2": "for a list of my skills and professional experiences.",
		"heading_2": "Skill Assessment",
		"h2_p1": "List of things that I know:",
		"about_me_list_01_items": [
			"HTML",
			"CSS",
			"Javascript",
			"PHP",
			"React",
			"Electron",
			"Python",
			"SQL",
			"Advanced Excel / Automation with VBA",
			"Powershell",
			"Bash",
			"Knowledge on both Windows and Linux based operating systems",
			"Basic C++",
			"Basic Java",
			"Kotlin"
		],
		"h2_p2": "I have a solid foundation in programming. Given enough time I can learn any language, framework, library, etc.",
		"h2_p3": "I have some knowledge with UI/UX design as well:",
		"about_me_list_02_items": [
			"Penpot",
			"Inkscape",
			"Figma",
			"Gimp",
			"Photoshop",
			"Blender",
			"Others"
		]
	},
	"index": {
		"title": "Home - André's Portfolio",
		"description": "Welcome to the main page of my website, please feel free to check the Portfolio and 'About me' sections for more details. You can also find how to contact me via the 'Contact' page.",
		"keywords": "andre carvalho, andre, carvalho, portfolio, developer, dev, hire, offers, curriculum, solo developer, html, css, javascript, php, c++, github, technology, freelancer, freelance, freelancing",
		"projects_heading": "Projects"
	},
	"portfolio": {
		"title": "Developer's Portfolio - Andre Carvalho",
		"description": "Here you can find my work and personal projects as a developer.",
		"keywords": "andre carvalho, andre, carvalho, portfolio, developer, dev, hire, offers, curriculum, solo developer, html, css, javascript, php, c++, github, technology, freelancer, freelance, freelancing",
		"my_repos": "My Public Repositories",
		"most_commits": "Most commits: ",
		"last_up": "Last updated",
		"source_code": "Source code",
		"checkout": "Check out this app",
		"projects_overview": {
			"title": "Projects Overview",
			"p1": "The next sections will be an insight into my most relevant personal projects. I will describe a bit about what the project is, what I learned from them, and the challenges I faced while working on it."
		}
	},
	"colorpicker": {
		"p1": "This is one of my favorite projects. It is a colorpicker tool I built on top of React.",
		"p2": "The purpose of this project was to serve as a learning exercise, since it was my first real React project.",
		"p3": "I know I might be biased, but I think it is a great tool. Not only you can pick colors, and copy their values, but you can also create palettes, and save your favorite colors.",
		"p4": "Palettes and colors are also nameable, which means you have the ability to organize your list of palettes and colors in a more structured way.",
		"p5": "For example, you might want to name your palette to reflect the project you are working on. Let's name it calculatorProject:",
		"p6_part1": "Then, you can add colors to your calculatorProject, which have predefined names — I used",
		"p6_color_name_link": "this great package for generating the color names",
		"p6_part2": ". For example:",
		"p7": "But you might want to rename them to better represent their role in your UI:",
		"p8": "You can add, remove and edit as many colors as you like. If you are on PC, you can also reorder the colors by holding click and dragging them.",
		"p9": "There are a few other functionalities that are interesting, like contrast ratio indicator, and the modifiers you can apply to the sliders. Feel free to",
		"p9_colorpicker_link": "try out my Colorpicker tool.",
		"p10": "This project helped me understand and solidify all the core concepts of React, like effects, states, writing components, lifting up states, derived states, memoization, and other things.",
		"add_palette_img_caption": "Adding a new palette.",
		"add_color_img_caption": "Adding a new color inside the palette.",
		"rename_color_img_caption": "Renaming a color."
	},
	"cv": {
		"title": "Curriculum Andre Carvalho Filho",
		"description": "Here you will find my curriculum vitae, with my professional experiences, profile summary, and technical skills.",
		"keywords": "andre carvalho, andre, carvalho, developer, software, dev, hire, oportunities, work, job, curriculum, freelance, freelancer",
		"role": "Software Developer",
		"origin": "My website:",
		"contact": "Contact",
		"phone": "Phone: ",
		"location": "Location: ",
		"location_val": "Curitiba - Paraná, Brazil",
		"tech_skills": "Technical Skills",
		"langs": "Languages",
		"langs_val": "JavaScript, HTML, CSS, PHP, TypeScript, SQL, Kotlin, C++ (basic), Java (basic), VBA, Powershell, Bash",
		"fws": "Frameworks",
		"fws_val": "React, Node.js, Electron",
		"dbs": "Databases",
		"dbs_val": "MySQL (basic)",
		"oth_tools": "Other tools",
		"oth_tools_val": "Git, Tailwind CSS, Figma, Penpot, Inkscape",
		"pro_sum": "Profile Summary",
		"pro_sum_desc_part1": "I'm a software developer, looking for my first opportunity in the Software development industry. My focus is always writing clean, modular and scalable code.",
		"pro_sum_desc_part2": "I am seeking challenging opportunities to improve my technical expertise and earn experience in the area. I am fluent both in English and Portuguese.",
		"pro_exp": "Professional Experience",
		"item1_company": "Cisco (via Foundever)",
		"item1_date": "Feb 2024 - Dec 2024",
		"item1_role": "Pre-sales Specialist - Enterprise Team",
		"item1_desc_part1": "I provided technical assistance to partners and internal teams regarding the Cisco Enterprise portfolio. Our support covered a wide range of topics, including differences between DNA subscriptions, supported features and protocols for specific network equipment, transceiver compatibility, and more.",
		"item1_desc_part2": "I also worked on creating predictive site surveys using Ekahau. Customers would send us floor plans, and we used the software to design predictive wireless network solutions tailored to their spaces.",
		"item1_desc_part3": "After Cisco ended the team I was part of, I was transferred to the Compliance Team (see below).",
		"item2_company": "Cisco (via Foundever)",
		"item2_date": "Dec 2024 - Sept 2025",
		"item2_role": "Compliance Specialist",
		"item2_desc_part1": "As a Compliance Agent, my role was to ensure that services being ordered complied with Cisco's policies and did not fall under their Non-Entitlement Policy.",
		"item2_desc_part2": "We inspected network equipment — specifically environmental system commands — to verify that the devices were functioning correctly and were legitimate Cisco products.",
		"save_pdf": "Save as PDF"
	},
	"themes": {
		"theme-dark": "Dark",
		"theme-light": "Light"
	},
	"cards": {
		"project": "Project:",
		"description": "Description:",
		"commits": "Commits:",
		"updated_at": "Last update:",
		"hover_txt": "go to github's repository page"
	},
	"words": {
		"note": "Note",
		"projects": "Projects"
	},
	"general": {
		"heading_title_copy": "Click to copy the link to this section.",
		"callout_collapse": "Click to collapse the callout.",
		"callout_expand": "Click to expand the callout."
	}
}